public class Int_Calculate {
    public static void main(String[] args) {
        int i = (100 + 200) * (99 - 88);
        int n = 7 * (5 + (i - 9));
        int[] a = {i, n};
        System.out.println(i + " " + n);
        System.out.println(a[0] + " " + a[1]);

//      两个整数相除求余只能得到结果的整数部分，不论前面的声明是什么
//      int是32位（4字节）的有符号整数，表示负的 2 的 31 次方，到正的 2 的 31 次方减 1
        int x = 12345 / 67;
        float z = 12345 / 67;
        int y = 12345 % 67;
        System.out.println(x + " " + y + " " + z);

//      溢出
        x = 2147483640;
        y = 15;
        System.out.println(x + y);// -2147483641
//      如果是long的话就不会溢出()
        long m = 2147483640;
        long n1 = 15;
        System.out.println(m + n1);

//      移位运算<<n,表示乘2的n次方，右移为除以，左移过多会变成负数
//      负数右移时候最高位1不动，结果仍为负数
        int a1 = 7;
        int a2 = a1 << 1;
        int a3 = a1 << 2;

//      位运算：按位进行与或非和异或的运算
        int i1 = 167776589; // 00001010 00000000 00010001 01001101
        int i2 = 167776512; // 00001010 00000000 00010001 00000000
        System.out.println(i1 & i2);
//      可以看为IP地址10.0.17.77和10.0.17.0，通过与运算可以快速判断一个IP是否在给定网段内

//      类型自动提升与强制转型：在运算过程中，如果参与运算的两个数类型不一致，那么计算结果为较大类型的整型。例如，short和int计算，结果总是int，原因是short首先自动被转型为int：
        short s = 1234;
        int i3 = 123456;
        int x3 = s + i3; // s自动转型为int
//      要注意，超出范围的强制转型会得到错误的结果，原因是转型时，int的两个高位字节直接被扔掉，仅保留了低位的两个字节：

//        练习：计算前N个自然数的和可以根据公式：
//2
//(1+N)×N
//请根据公式计算前N个自然数的和：
        int num = 100;
        int sum = (1 + 100) * 100 / 2;
        System.out.println(sum);

        /*
        小结
整数运算的结果永远是精确的；

运算结果会自动提升；

可以强制转型，但超出范围的强制转型会得到错误的结果；

应该选择合适范围的整型（int或long），没有必要为了节省内存而使用byte和short进行整数运算。
         */
    }
}
